 gcc -g p1original.c
 ./a.out
Enter the base and height of the triangle
2
3
The area of triangle with base 2.000000 and height 3.000000 is 3.000000 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x822: file p1original.c, line 16.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main ()
    at p1original.c:16
16  {
(gdb) n
18    input(&a,&b);
(gdb) s
input (base=0x7ffcdf88772c, 
    height=0x7ffcdf887730)
    at p1original.c:4
4     printf("Enter the base and height of the triangle\n");
(gdb) n
Enter the base and height of the triangle
5     scanf("%f %f",base,height);
(gdb) n
2
3
6   }
(gdb) n
main () at p1original.c:19
19    find_area(a,b,&c);
(gdb) p a
$1 = 2
(gdb) p b
$2 = 3
(gdb) s
find_area (base=2, height=3, 
    area=0x7ffcdf887734)
    at p1original.c:9
9     *area=0.5*base*height;
(gdb) n
10  }
(gdb) n
main () at p1original.c:20
20    output(a,b,c);
(gdb) s
output (base=2, height=3, area=3)
    at p1original.c:13
13    printf("The area of triangle with base %f and height %f is %f",base,height,area);
(gdb) n
14  }
(gdb) n
main () at p1original.c:21
21    return 0;
(gdb) p c
$3 = 3
(gdb) n
22  }(gdb) q
A debugging session is active.

    Inferior 1 [process 1052] will be killed.

Quit anyway? (y or n) y
